# CreateEnhancedPullDownMenu

## Description
Creates a Layout Manager enhanced pull down menu control.

```pascal
PROCEDURE CreateEnhancedPullDownMenu(
				dialogID              : LONGINT;
				componentID           : LONGINT;
				widthInStdChar        : INTEGER;
				bShowIconInMainWindow : BOOLEAN);
```

```python

def vs.CreateEnhancedPullDownMenu(dialogID, componentID, widthInStdChar, bShowIconInMainWindow):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|widthInStdChar|INTEGER|The width of the displayed text in standard character count. See GetDlgCtrlWidthStdCh.|
|bShowIconInMainWindow|BOOLEAN||

## See Also
VS Functions:
GetDlgCtrlWidthStdCh

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern